[
{
"_id": "618d35fb0677f9715c295833",
"title": "Morning Sunshine",
"img": "https://i.ibb.co/hckJVC1/morning-sunshine.jpg",
"description": "A bit of a dream, a bit of stories and some parts of imagination are interwoven in this magnificent bouquet. Show how much brighter they make your days with this smiling mix of fresh flowers. Like a little sunshine, our bouquet of delightful flowers, Morning Sunshine, will bring happiness in the dullest of moods. Bright yellow carnations and roses, white Rajaniganda, limonium and greens – just like the sun peeking through the morning clouds behind a tree – are dramatically showcased in a contemporary white bamboo vase accented by a chiffon bow. Do you know someone who could use a little sunshine? If you do; send him/ her a shining smile with our bright and fresh bouquet on your anniversary, his / her birthday, to congratulate or to surprise that special someone.Order online today on our website and our marvelous arrangement will be delivered to your doorstep.The popular white vase will be seen a glittering gift for now and forever.So order it today and preserve your mesmerizing memories for the years to come!",
"price": 85
},
{
"_id": "618d35fb0677f9715c295828",
"title": "True Love",
"img": "https://i.ibb.co/pv2XpPS/true-love.jpg",
"description": "Proclaim your true love with this breathtaking bouquet now! Three splendid red roses, gathered with alluring greens in a wrapping paper full of lovely messages, is a romantic gift your loved one won’t ever forget. Imagine your loved ones’ smile when this lovely bouquet of roses arrives at her door – for no special reason at all.Except that you love them.Say all you have in your heart simply sending a message using our greeting card and see the magic of love on her face!",
"price": 40
},
{
"_id": "618d35fb0677f9715c29582e",
"title": "First Blush",
"img": "https://i.ibb.co/j8c4svR/first-blush.jpg",
"description": "Shades of purple are in perfect harmony with the striking white in this profoundly pretty arrangement. First Blush is a lovely mix of classic and modern, ribbons and roses, it’s sure to make someone’s day! This exotic gift is a poignant way to celebrate tender moments and a love that endures.White fresh roses and chrysanthemums, and greens are hand- delivered in a curled purple wrapping paper that’s all wrapped up with a vibrant white taffeta ribbon.For warm and lovable thoughts sweetly expressed, this arrangement does the trick.This bouquet is perfect for anyone who’s passionate about white and purple.A pretty mix of fresh and beautiful flowers full of majestic beauty and delivered with a message.Perfect for birthdays, anniversaries, extend warm wishes – or any day you want to make her feel extra special.Order online and make someone special feel like a princess today!",
"price": 60
},
{
"_id": "618d35fb0677f9715c295831",
"title": "Soulmate",
"img": "https://i.ibb.co/6NLBryC/soulmate.jpg",
"description": "Lush, lavish and spectacularly chic, this gorgeous contemporary bouquet of red roses in a gorgeous white wrapping paper makes an exciting gift for almost anyone. For classic romance, red roses are always the perfect choice. The elegant bouquet features five fresh hot red roses accented with assorted greenery which is delivered in a white fibrous wrapping paper tied with a white satin ribbon. Wouldn’t you love for someone to send it to you? This explosion of love, along with red roses, adds just the right spark for an anniversary, birthday or a romantic date out.This luscious arrangement is almost too pretty for words.But you’ll hear many words of praise and love for sending it, especially after getting it hand- delivered.So, order online via our website today and share the intimate bond of love with your Soul Mate.",
"price": 50
},
{
"_id": "618d35fb0677f9715c29582c",
"title": "Flowery Break",
"img": "https://i.ibb.co/HnHswBq/flowery-break.jpg",
"description": "Take a break today from your busy life and imagine walking in an enchanting garden and coming across a hidden treasure full of everyone’s favorite chocolate, Kit Kat! Or, just order our newest bouquet – Flowery Break – for that! This harmonious bouquet contains lush white roses, gerberas, carnations and lilies with fresh - greens for an elegant garden look full of heart- shaped goodies presented in an exclusive clear vase! It will enchant everyone with its glossy, graceful leaves and stunning white flowers.Because of the softness and elegance, it is a stunning choice for any occasion: Anniversaries, Birthdays and Mother’s Day etc.It is a wonderful way to send your love, or to brighten up any lucky person’s day.Chocolate cravings meet freshness in this beautiful and aristocratic arrangement.So, order one today and receive it at your doorstep now!",
"price": 150
},
{
"_id": "618d35fb0677f9715c295834",
"title": "Candle Lit Romance",
"img": "https://i.ibb.co/xhq3Gyn/candle-lit-romance.jpg",
"description": "A classic candle glowing warmly, shedding its soft light on a lush arrangement on gorgeous flowers – what a feast for the eyes! Reminisce the old times and wish for the times to come with our exquisite bouquet “Candle Lit Romance”. Send your special person this blushing mix of red roses, red gerberas topped with some blue/ purple static fresh flowers – simply presented with some seasonal fanned leaves and dry flowers delivered in an ornamental basket with a candle centerpiece – and they’ll know they mean the world to you. Whether it is your first anniversary or your fiftieth, birthdays or a romantic night out, celebrate your special bond to express your love & romance with our luminous arrangement of “Candle Lit Romance” bouquet.These freshly picked flowers enchanted with love and care will be hand - delivered at your doorstep.Our bouquets are always high quality, fresh, and affordable.Order online now and our quick delivery means you are never too late to send a great gift.May the luminous glow of our bouquet bring happiness and more love for the times to come.",
"price": 90
},
{
"_id": "618d35fb0677f9715c29582b",
"title": "Strong and Sweet",
"img": "https://i.ibb.co/GVJXtd5/strong-and-sweet.jpg",
"description": "She wears a cape, is the sweetest, and has a kaleidoscope of abilities, and she is no one other than our bouquet – Strong and Sweet. The name suggests how sweetly it’s adorned with an array of flowers.This strong bouquet contains blue orchids, angelic white and yellow roses with violet carnations with fresh - greens fanning out behind the flowers like a cape of a superhero.Also let’s not forget about the white pocket, graced with a purple ribbon and pearls, containing the two sweet Dairy Milks, she has to offer!",
"price": 90
},
{
"_id": "618d35fb0677f9715c29582a",
"title": "Sweet Memory",
"img": "https://i.ibb.co/XtPsb0q/sweet-memory.jpg",
"description": "Send them on a dreamy stroll through a sweet memory with this perfect-for-any-occasion bouquet. Soft baby pink/ shade pink / magenta / white roses, Limonium and hand - crafted white flowers holding Ferraro Rochers.The whole arrangement is built on a majestic goblet, giving the bouquet a very regal look! Your beloved recipient is sure to fall in love with it – and you all over again! Order it today online and receive it at the doorstep.Don’t forget to add a sweet personalized message reminding them of all your good times together!",
"price": 65
},
{
"_id": "618d35fb0677f9715c29582f",
"title": "Elegance",
"img": "https://i.ibb.co/Cvn2c2r/elegance.jpg",
"description": "Like something out of an old Hollywood film, this elegant bouquet is all about classic romance. Romance blossoms beautifully within this elegant bouquet. Honor your timeless love with our ravishing bouquet, Elegance, and a magnificent vase she’ll always hold close to her heart! The serenity and innocence of cream- colored roses, carnations and chrysanthemums is in delightful combination with red roses and gerberas and fresh ivy greens – is hand - delivered in a clear champagne glass that he / she’ll treasure forever.It’s as romantic as a stroll through the countryside. When you give this wondrous mix of fresh blossoms in jewel - toned shades, you’ll show your true color - devotion, a warm heart and a bright spirit! A lovely gift for a birthday, anniversary, date night or to celebrate any special day.Let someone special know how much their love means to you by sending them this truly original arrangement by ordering online.Is this perfection ? You bet!",
"price": 70
},
{
"_id": "618d35fb0677f9715c295827",
"title": "Red Velvet",
"img": "https://i.ibb.co/tcCrpYP/red-velvet.jpg",
"description": "Festive blooms, like Red Velvet, in bold, primary colours are a fun way to express your friendship and love! This enchanting bouquet features red velvety roses and green chrysanthemums/ statice / limonium adorned with green leaves, golden pearls, ribbons and paper.The perfect bouquet to energize any occasion! Make someone’s day with Red Velvet today, it doesn’t matter if it’s an ordinary day or an occasion! Order away and relax for the bouquet to arrive at your door.Also, add a personalized message and say all you want to say in words.When you want to send something exciting and unexpected, this is your go - to - bouquet! ",
"price": 75
},
{
"_id": "618d35fb0677f9715c295832",
"title": "Hollywood Dream",
"img": "https://i.ibb.co/mNznT99/hollywood-dream.jpg",
"description": "The stuff that dreams are made of! Ready for the runway, as if it were. This ethereal bouquet of exquisite, colorful and fresh flowers in a golden or greenish wrapping paper has a touch of vintage charm – and more than a touch of timeless romance! This beautiful bouquet includes an array of blooms like yellow roses and miniature purple or magenta carnations – all accented with fresh green leaves and limonium.Delivered in a beautiful golden or greenish mesh and tied together with an exquisite white bow. Lovely purple/ magenta carnations are enchanting and exotic.So, if you really want to wow them, order online and send this distinctive and lovely arrangement.This gorgeous arrangement is perfect for anniversaries, birthdays, or to congratulate someone and is hand - delivered with love and care.It will most certainly arrive in style! A delightful combination of light colors and lovely flowers, it’s simply beautiful.A Hollywood star to stare at!",
"price": 75
},
{
"_id": "618d35fb0677f9715c295829",
"title": "Garden of Freshness",
"img": "https://i.ibb.co/pL6SmxW/garden-of-freshness.jpg",
"description": "Put on a show with garden-fresh summer flowers! Surprise someone with a handled basket, adorned with golden pearls and flowers to give it an ethereal look. The colorful composition in the basket features red, yellow and baby pink/ magenta/ shade pink/ white roses, along with green chrysanthemums/ statice/ limonium and leaves to give it a fresh look! Like a miniature summer garden, the fresh cut flowers will brighten a bedside table, coffee table… any of their favorite places. It’s hand delivered by a local florist with a customized message by you for an extra special touch!",
"price": 110
},
{
"_id": "618d35fb0677f9715c29582d",
"title": "Cinderella",
"img": "https://i.ibb.co/qRwTQ4Y/cinderella.jpg",
"description": "Brush off the cinder, add a sparkle to your life and step into the dazzling shoes to enter a magical world of happily ever after… Or, you can just get a hold of our enchanting bouquet: Cinderella. A Light pink rose and Gerbera are mixed with white statice and some seasonal greens which are hand- delivered in an exclusively designed beaded - shoe vase(a keepsake gift they’ll enjoy forever). Brighten your lady’s day with the perfect flower arrangement for any occasion like Mother’s day, birthdays and anniversaries.Let them know you’re thinking of them with Cinderella.Even if she’s already in a great mood, this cheerfully charming bouquet will boost her spirits to the sky.Sing your love out loud and order it today on our website before the clock strikes 12!",
"price": 120
},
{
"_id": "618d35fb0677f9715c295826",
"title": "Colorful Ride",
"img": "https://i.ibb.co/X3TBwbV/colorful-ride.jpg",
"description": "A rainbow in a ride to mark the beginning of new journeys! The perfect gift to cheer up a special someone when they need a smile! Presented in a white miniature carriage, this colourful arrangement includes yellow/ orange and baby pink / shade pink / magenta / white roses, dark purple / light purple / magenta carnations along with fresh greens and Limonium / gypsy, giving it a versatile pick for any occasion. This cheerful array of colourful blossoms can be hand - delivered at the doorstep anywhere in Dhaka.Don’t forget to add a personalized message, which will be delivered in a complimentary card with the bouquet.Whether it’s a new journey or a journey to remember, Colorful Ride is the perfect choice to reminisce that memory!",
"price": 70
},
{
"_id": "618d35fb0677f9715c295830",
"title": "Circle of Love",
"img": "https://i.ibb.co/zF24Mph/circle-of-love.jpg",
"description": "If you’d like someone to think sweet thoughts about you, send them our delightful bouquet, Circle of Love! Whether you just met someone or you just fell in love, red roses are a classic way to show just how much you care. In Circle of Love, graceful red roses appears to float above, is nestled in a white vase and enchanted with silver, red and white decors.How sweet it is! The depth of color in red roses gives them a velvet quality that is unmatched by any other flower.Their romantic appeal is unsurpassed.Make a luxurious proclamation of your love on Valentine’s Day, birthdays and anniversaries with this show- stopping arrangement.Put the order online and send this kiss of bliss! From their slender, green stems to their dense and unmistakable blossoms, roses add an unmatched beauty and panache.Order and receive our fresh, luminous bouquet right at your doorstep.",
"price": 110
}
]